# 类别数量
nc: 80  # 80类目标，对应COCO数据集

# 模型复合缩放常数
scales:
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n 总结: 225层, 3157200参数, 8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s 总结: 225层, 11166560参数, 28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m 总结: 295层, 25902640参数, 79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l 总结: 365层, 43691520参数, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x 总结: 365层, 68229648参数, 258.5 GFLOPs

# YOLOv8.0n 主干网络
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# YOLOv8.0n 检测头
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # 拼接主干网络 P4
  - [-1, 3, C2f, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # 拼接主干网络 P3
  - [-1, 3, C2f, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # 拼接检测头 P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # 拼接检测头 P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]  # 检测头 (P3, P4, P5)
